SecurityEvent
| where EventID == 4740
| extend
    LockedOutAccount = TargetUserName,
    Computer = TargetDomainName,
    Domain = SubjectDomainName,
    DomainController = Computer
| project TimeGenerated, LockedOutAccount, Domain, CallerComputer, DomainController
