SecurityEvent
| where EventID == 4740
| extend
    LockedOutAccount = TargetUserName,
    Computer = TargetDomainName,
    Domain = SubjectDomainName,
    DomainController = SubjectUserName
| project TimeGenerated, LockedOutAccount, Domain, Computer, DomainController
