SecurityEvent
| where EventID in (4729, 4733, 4746, 4757)
| extend
    Remover = SubjectUserName,
    RemovedUser = extract(@'MemberName">([^<]+)', 1, EventData),
    Group = tostring(split(TargetUserName, "\\")[1])
| project TimeGenerated, Remover, RemovedUser, Group, EventID
