DeviceProcessEvents
| where (FileName in~ ("pip.exe", "pip3.exe") and ProcessCommandLine contains "install")
    or ProcessCommandLine has_all ("python", "-m", "pip", "install")
| extend
    User = AccountName,
    Domain = AccountDomain,
    PCName = DeviceName
| extend Library = extract(@'install\s+([\S]+)', 1, ProcessCommandLine)
| project TimeGenerated, User, Domain, PCName, Library, ProcessCommandLine
